In [29]:
import pandas as pd # import pandas library
import numpy as np # import numpay library
import seaborn as sns # import seaborn library for data visulizing 
import matplotlib.pyplot as plt # import matplotlib library
%matplotlib inline    
## all matplotlib inline not stored in memory to fast execution and save memory. 
plt.style.use("ggplot") ## to select matplotlib grahical style
import warnings # to ignore any version or something errors.
pd.set_option('display.float_format', lambda x: '%.3f' % x) # To supress numerical display in scientific notations

In [2]:
data = pd.read_csv('Dateset_ODI.csv')

In [3]:
data.head()

,Scorecard,Team 1,Team 2,Winner,Margin,Ground,Match Date
0,ODI # 1,Australia,England,Australia,5 wickets,Melbourne,"Jan 5, 1971"
1,ODI # 2,England,Australia,England,6 wickets,Manchester,"Aug 24, 1972"
2,ODI # 3,England,Australia,Australia,5 wickets,Lord's,"Aug 26, 1972"
3,ODI # 4,England,Australia,England,2 wickets,Birmingham,"Aug 28, 1972"
4,ODI # 5,New Zealand,Pakistan,New Zealand,22 runs,Christchurch,"Feb 11, 1973"

In [4]:
data.shape

(3932, 7)

In [8]:
a = ['x', 'y', 'z']
b = ['w']

In [9]:
a.append(b)
a

['x', 'y', 'z', ['w']]

In [12]:
a = ('x', 'y', 'z')

In [14]:
a[0] = 't'
a

TypeError: 'tuple' object does not support item assignment

In [38]:
data[["Ground", "Winner"]].groupby("Ground").count().max()

Winner    228
dtype: int64

data.describe()

In [63]:
data1= data[["Ground", "Winner"]].groupby("Ground").count().sort_values(by = "Ground", ascending = True)

               Winner
Ground
Aberdeen           11
Abu Dhabi          37
Adelaide           82
Ahmedabad          24
Albion              5
...               ...
Vijayawada          1
Visakhapatnam      11
Wellington         56
Whangarei           1
Worcester           3

[173 rows x 1 columns]

In [67]:
df1 = data[data['Ground'] == 'Sharjah']

df1['Winner'].value_counts()

Pakistan        83
India           35
Sri Lanka       29
West Indies     19
Australia       14
South Africa    10
New Zealand      9
Afghanistan      9
Zimbabwe         8
England          8
tied             2
Canada           1
Netherlands      1
Name: Winner, dtype: int64

In [68]:
df1 = data[data['Winner'] == 'Australia']

df1['Ground'].value_counts()

Sydney        85
Melbourne     74
Adelaide      34
Perth         29
Brisbane      23
              ..
Benoni         1
Amstelveen     1
Faisalabad     1
Kochi          1
Bristol        1
Name: Ground, Length: 97, dtype: int64

In [70]:
(data['Team 2'] == data['Winner']).sum()

1637

In [73]:
df1 = data[data['Ground'] == "Lord's"]

df1['Winner'].value_counts()

England         23
Australia       12
West Indies      6
India            4
Sri Lanka        4
Pakistan         4
New Zealand      3
tied             2
South Africa     1
no result        1
Name: Winner, dtype: int64

In [55]:
x = 1

for i in range(1,10,2):

    print(x*i)

1
3
5
7
9

In [56]:
a = np.array([['m', '2'],['n','3']])
a[0,1]

'2'